configuration_andre.org
** Wrap paragraphs automatically

=AutoFillMode= automatically wraps paragraphs, kinda like hitting =M-q=. I wrap
a lot of paragraphs, so this automatically wraps 'em when I'm writing text,
Markdown, or Org.

#+BEGIN_SRC emacs-lisp
  (add-hook 'text-mode-hook 'turn-on-auto-fill)
  (add-hook 'gfm-mode-hook 'turn-on-auto-fill)
  (add-hook 'org-mode-hook 'turn-on-auto-fill)
#+END_SRC

Sometimes, though, I don't wanna wrap text. This toggles wrapping with =C-c q=:

#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "C-c q") 'auto-fill-mode)
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (setq-default fill-column 100)
#+END_SRC

** Always switch to temp-buffer after opening.

I want to always move the focus to the just opened temp-buffer (help buffer).

#+BEGIN_SRC emacs-lisp
(add-hook 'temp-buffer-show-hook (lambda () (other-window 1)))
;;(remove-hook 'temp-buffer-window-show-hook (lambda () (other-window 1))
;;(remove-hook 'help-mode-hook (lambda () (other-window 1)))
#+END_SRC


** Linting prose

I use [[http://proselint.com/][proselint]] to check my prose for common errors. This creates a flycheck
checker that runs proselint in texty buffers and displays my errors.

#+BEGIN_SRC emacs-lisp
  (require 'flycheck)

  (flycheck-define-checker proselint
    "A linter for prose."
    :command ("proselint" source-inplace)
    :error-patterns
    ((warning line-start (file-name) ":" line ":" column ": "
              (id (one-or-more (not (any " "))))
              (message (one-or-more not-newline)
                       (zero-or-more "\n" (any " ") (one-or-more not-newline)))
              line-end))
    :modes (text-mode markdown-mode gfm-mode org-mode))

  (add-to-list 'flycheck-checkers 'proselint)
#+END_SRC

Use flycheck in the appropriate buffers:

#+BEGIN_SRC emacs-lisp
  (add-hook 'markdown-mode-hook #'flycheck-mode)
  (add-hook 'gfm-mode-hook #'flycheck-mode)
  (add-hook 'text-mode-hook #'flycheck-mode)
  (add-hook 'org-mode-hook #'flycheck-mode)
#+END_SRC

** Enable region case modification

**

#+BEGIN_SRC emacs-lisp
  (put 'downcase-region 'disabled nil)
  (put 'upcase-region 'disabled nil)
#+END_SRC

** Switch windows when splitting

When splitting a window, I invariably want to switch to the new window. This
makes that automatic.

#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "C-x 2") 'hrs/split-window-below-and-switch)
  (global-set-key (kbd "C-x 3") 'hrs/split-window-right-and-switch)
#+END_SRC

** Mass editing of =grep= results

I like the idea of mass editing =grep= results the same way I can edit filenames
in =dired=. These keybindings allow me to use =C-x C-q= to start editing =grep=
results and =C-c C-c= to stop, just like in =dired=.

#+BEGIN_SRC emacs-lisp
  (eval-after-load 'grep
    '(define-key grep-mode-map
      (kbd "C-x C-q") 'wgrep-change-to-wgrep-mode))

  (eval-after-load 'wgrep
    '(define-key grep-mode-map
      (kbd "C-c C-c") 'wgrep-finish-edit))

  (setq wgrep-auto-save-buffer t)
#+END_SRC

** Configure =wrap-region=

#+BEGIN_SRC emacs-lisp
  (wrap-region-global-mode t)
  (wrap-region-add-wrapper "/" "/" nil 'ruby-mode)
  (wrap-region-add-wrapper "`" "`" nil '(markdown-mode ruby-mode))
#+END_SRC

** Split horizontally for temporary buffers

Horizonal splits are nicer for me, since I usually use a wide monitor. This is
handy for handling temporary buffers (like compilation or test output).
--> Removed for now as this messes up temporary buffers.

# #+BEGIN_SRC emacs-lisp
#   (defun hrs/split-horizontally-for-temp-buffers ()
#     (when (one-window-p t)
#       (split-window-horizontally)))

#   (add-hook 'temp-buffer-window-setup-hook
#             'hrs/split-horizontally-for-temp-buffers)
# #+END_SRC

** Use projectile everywhere

#+BEGIN_SRC emacs-lisp
  (projectile-global-mode)
#+END_SRC

** Add a bunch of engines for =engine-mode=

Enable [[https://github.com/hrs/engine-mode][engine-mode]] and define a few useful engines.

#+BEGIN_SRC emacs-lisp
  (require 'engine-mode)

  (defengine duckduckgo
    "https://duckduckgo.com/?q=%s"
    :keybinding "d")

  (defengine github
    "https://github.com/search?ref=simplesearch&q=%s"
    :keybinding "g")

  (defengine google
    "http://www.google.com/search?ie=utf-8&oe=utf-8&q=%s")

  (defengine rfcs
    "http://pretty-rfc.herokuapp.com/search?q=%s")

  (defengine stack-overflow
    "https://stackoverflow.com/search?q=%s"
    :keybinding "s")

  (defengine wikipedia
    "http://www.wikipedia.org/search-redirect.php?language=en&go=Go&search=%s"
    :keybinding "w")

  (defengine wiktionary
    "https://www.wikipedia.org/search-redirect.php?family=wiktionary&language=en&go=Go&search=%s")

  (engine-mode t)
#+END_SRC

** Do not move frame screen focus along with mouse

#+BEGIN_SRC emacs-lisp
(setq mouse-autoselect-window nil)
#+END_SRC

** Use Discover to get more info from other modules.

#+BEGIN_SRC emacs-lisp
(discover-add-context-menu
 :context-menu '(isearch
              (description "Isearch, occur and highlighting")
              (lisp-switches
               ("-cf" "Case should fold search" case-fold-search t nil))
              (lisp-arguments
               ("=l" "context lines to show (occur)"
                "list-matching-lines-default-context-lines"
                (lambda (dummy) (interactive) (read-number "Number of context lines to show: "))))
              (actions
               ("Isearch"
                ("_" "isearch forward symbol" isearch-forward-symbol)
                ("w" "isearch forward word" isearch-forward-word))
               ("Occur"
                ("o" "occur" occur))
               ("More"
                ("h" "highlighters ..." makey-key-mode-popup-isearch-highlight))))
 :bind "M-s d")
#+END_SRC


* Set custom keybindings
Hit F10 to toggle between =fullscreen= and back.

#+BEGIN_SRC emacs-lisp
(define-key global-map (kbd "<f10>") 'toggle-frame-fullscreen)
(define-key global-map (kbd "<end>") 'org-end-of-line)
(define-key global-map (kbd "<home>") 'org-beginning-of-line)

#+END_SRC

* Programming Language Tools
** GO
*** go-mode-hook
Enable gorepl-mode in go-mode buffers:

#+BEGIN_SRC emacs-lisp
;;(add-hook 'go-mode-hook 'gorepl-mode)
;;(add-hook 'go-mode-hook 'flymake-mode)
(add-hook 'go-mode-hook 'flycheck-mode)
(add-hook 'go-mode-hook 'git-gutter-mode)
;;(remove-hook 'go-mode-hook 'flymake-mode)
#+END_SRC


Exammple of hook with lambda function.
#+BEGIN_SRC emacs-lisp
;  (add-hook 'go-mode-hook
;            (lambda () (local-set-key (kbd "M-n") 'org-capture-todo)))
#+END_SRC

*** Settings for company-go


#+BEGIN_SRC emacs-lisp
  (setq company-tooltip-limit 20)                      ; bigger popup window
  (setq company-idle-delay .3)                         ; decrease delay before autocompletion popup shows
  (setq company-echo-delay 0)                          ; remove annoying blinking
  (setq company-begin-commands '(self-insert-command)) ; start autocompletion only after typing

;;  (add-to-list 'company-backends 'company-go)          ; add company-go to the backends.
#+END_SRC

*** Settings for goflymake

Flycheck settings:

#+BEGIN_SRC emacs-lisp
(add-to-list 'load-path "~/.go/src/github.com/dougm/goflymake")
   (require 'go-flymake)
#+END_SRC

Flycheck settings:

#+BEGIN_SRC emacs-lisp
 (add-to-list 'load-path "~/gocode/src/github.com/dougm/goflymake")
    (require 'go-flycheck)
#+END_SRC

*** gofmt to format go when saving

#+BEGIN_SRC emacs-lisp
; Use goimports instead of go-fmt
(setq gofmt-command "goimports")
(add-hook 'before-save-hook 'gofmt-before-save)
#+END_SRC
*** Keybindings

Keybindings for gorepl

#+BEGIN_SRC emacs-lisp
(with-eval-after-load "gorepl-mode"
 (define-key gorepl-mode-map (kbd "C-<return>") 'gorepl-eval-line)
)
#+END_SRC

#+BEGIN_SRC emacs-lisp
(defun my-go-mode-hook ()
  (define-key global-map (kbd "M-.") nil)
  (define-key global-map (kbd "M-,") nil)
  (local-set-key (kbd "M-.") 'godef-jump)
  (local-set-key (kbd "M-,") 'pop-tag-mark)
)
(add-hook 'go-mode-hook 'my-go-mode-hook)
#+END_SRC

*** Links on how to customize
- http://tleyden.github.io/blog/2014/05/22/configure-emacs-as-a-go-editor-from-scrat

** Python
*** Settings for company autocompletion.

Add company-jedi to company backends.

#+BEGIN_SRC emacs-lisp
;;  (add-to-list 'company-backends 'company-jedi)          ; add company-jedi to the backends.
#+END_SRC
** Global Flycheck

# #+BEGIN_SRC emacs-lisp
# (use-package flycheck
#   :ensure t
#   :init
# (global-flycheck-mode))
# #+END_SRC

** PATH Settings

#+BEGIN_SRC emacs-lisp
(exec-path-from-shell-copy-env "GOPATH")
#+END_SRC

** Gitgutter

#+BEGIN_SRC emacs-lisp
(global-git-gutter-mode t)
#+END_SRC

** Node-js

*** js2-mode

Load js2-mode for javascript files

#+BEGIN_SRC emacs-lisp
(require 'js2-mode)
(add-to-list 'auto-mode-alist '("\\.js\\'" . js2-mode))

#+END_SRC

*** Node REPL

#+BEGIN_SRC emacs-lisp
  (with-eval-after-load "nodejs-repl-mode"
    (require 'nodejs-repl-eval)
  )
#+END_SRC
*** Keybindings

Keybindings for node REPL.

#+BEGIN_SRC emacs-lisp
(defun my-js2-mode-hook ()
  (local-set-key (kbd "C-<return>") 'nodejs-repl-eval-dwim)
)
(add-hook 'js2-mode-hook 'my-js2-mode-hook)
#+END_SRC
